In [1]:
import numpy as np
np.set_printoptions(threshold=50)
path_data = '../../assets/data/'

In [3]:
! ls  ../../assets/data/

actors.csv	    galton.csv			   observed_outcomes.csv
airline_ontime.csv  galton_subset.csv		   potential_outcomes.csv
all-lprs.csv.gz     grades_and_piazza.csv	   roulette_wheel.csv
anscombe.csv	    heights.csv			   san_francisco_2015.csv
baby.csv	    hodgkins.csv		   san_francisco_2019.csv
banknote.csv	    house.csv			   sat2014.csv
birds.csv	    hybrid.csv			   scores_by_section.csv
birth_time.csv	    hybrid_reg.csv		   shotput.csv
breast-cancer.csv   income_small.csv		   sons_heights.csv
bta.csv		    IV.csv			   station.csv
children_raw.csv    kaiser_ethnicity_children.csv  top_movies_2017.csv
ckd.csv		    kaiser_ethnicity_everyone.csv  top_movies.csv
cones.csv	    little_women.csv		   trip.csv
couples.csv	    married_couples.csv		   unfair_flips.csv
deflategate.csv     minard.csv			   united_summer2015.csv
dugongs.csv	    movies_by_year.csv		   usa_ca_2014.csv
educ_inc.csv	    nba2013.csv			   usa_ca_2019.csv
everyone_raw.csv    nba_salaries.csv		   us_women.csv
faithful.csv	    nc-est2014-agesex-res.csv	   wine.csv
family_heights.csv  nc-est2015-agesex-res.csv
football.csv	    nc-est2019-agesex-res.csv

# Tables

Tables are a fundamental object type for representing data sets. A table can be viewed in two ways:
* a sequence of named columns that each describe a single aspect of all entries in a data set, or
* a sequence of rows that each contain all information about a single entry in a data set.

In order to use tables, import all of the module called `datascience`, a module created for this text.

In [4]:
from datascience import *

Empty tables can be created using the `Table` function. An empty table is useful because it can be extended to contain new rows and columns.

In [5]:
Table()

The `with_columns` method on a table constructs a new table with additional labeled columns. Each column of a table is an array. To add one new column to a table, call `with_columns` with a label and an array. (The `with_column` method can be used with the same effect.)

Below, we begin each example with an empty table that has no columns.

In [6]:
Table().with_columns('Number of petals', make_array(8, 34, 5))

Number of petals
8
34
5

To add two (or more) new columns, provide the label and array for each column. All columns must have the same length, or an error will occur.

In [7]:
Table().with_columns(
    'Number of petals', make_array(8, 34, 5),
    'Name', make_array('lotus', 'sunflower', 'rose')
)

Number of petals | Name
8                | lotus
34               | sunflower
5                | rose

We can give this table a name, and then extend the table with another column.

In [8]:
flowers = Table().with_columns(
    'Number of petals', make_array(8, 34, 5),
    'Name', make_array('lotus', 'sunflower', 'rose')
)

flowers.with_columns(
    'Color', make_array('pink', 'yellow', 'red')
)

Number of petals | Name      | Color
8                | lotus     | pink
34               | sunflower | yellow
5                | rose      | red

The `with_columns` method creates a new table each time it is called, so the original table is not affected. For example, the table `flowers` still has only the two columns that it had when it was created.

In [9]:
flowers

Number of petals | Name
8                | lotus
34               | sunflower
5                | rose

In [11]:
flowers = flowers.with_columns(
    'Color', make_array('pink', 'yellow', 'red')
)
flowers

Number of petals | Name      | Color
8                | lotus     | pink
34               | sunflower | yellow
5                | rose      | red

Creating tables in this way involves a lot of typing. If the data have already been entered somewhere, it is usually possible to use Python to read it into a table, instead of typing it all in cell by cell.

Often, tables are created from files that contain comma-separated values. Such files are called CSV files.

Below, we use the Table method `read_table` to read a CSV file that contains some of the data used by Minard in his graphic about Napoleon's Russian campaign. The data are placed in a table named `minard`.

In [9]:
minard = Table.read_table ( path_data + 'minard.csv' )
minard

In [ ]:
print ( )

In [10]:
minard.show()

We will use this small table to demonstrate some useful Table methods. We will then use those same methods, and develop other methods, on much larger tables of data.

<h2>The Size of the Table</h2>

The method `num_columns` gives the number of columns in the table, and `num_rows` the number of rows.

In [11]:
minard.num_columns

In [12]:
minard.num_rows

<h2>Column Labels</h2>

The method `labels` can be used to list the labels of all the columns. With `minard` we don't gain much by this, but it can be very useful for tables that are so large that not all columns are visible on the screen.

In [13]:
minard.labels

We can change column labels using the `relabeled` method. This creates a new table and leaves `minard` unchanged.

In [14]:
minard.relabeled('City', 'City Name')

However, this method does not change the original table.

In [15]:
minard

A common pattern is to assign the original name `minard` to the new table, so that all future uses of `minard` will refer to the relabeled table.

In [16]:
minard = minard.relabeled('City', 'City Name')
minard

<h2>Accessing the Data in a Column</h2>

We can use a column's label to access the array of data in the column.

In [17]:
minard.column('Survivors')

The 5 columns are indexed 0, 1, 2, 3, and 4. The column `Survivors` can also be accessed by using its column index.

In [18]:
minard.column(4)

The 8 items in the array are indexed 0, 1, 2, and so on, up to 7. The items in the column can be accessed using `item`, as with any array.

In [19]:
minard.column(4).item(0)

In [20]:
minard.column(4).item(5)

<h2>Working with the Data in a Column</h2>

Because columns are arrays, we can use array operations on them to discover new information. For example, we can create a new column that contains the percent of all survivors at each city after Smolensk.

In [21]:
initial = minard.column('Survivors').item(0)
minard = minard.with_columns(
    'Percent Surviving', minard.column('Survivors')/initial
)
minard

To make the proportions in the new columns appear as percents, we can use the method `set_format` with the option `PercentFormatter`. The `set_format` method takes `Formatter` objects, which exist for dates (`DateFormatter`), currencies (`CurrencyFormatter`), numbers, and percentages.

In [22]:
minard.set_format('Percent Surviving', PercentFormatter)

<h2>Choosing Sets of Columns</h2>

The method `select` creates a new table that contains only the specified columns.

In [23]:
minard.select('Longitude', 'Latitude')

The same selection can be made using column indices instead of labels.

In [24]:
minard.select(0, 1)

The result of using `select` is a new table, even when you select just one column.

In [25]:
minard.select('Survivors')

Notice that the result is a table, unlike the result of `column`, which is an array.

In [26]:
minard.column('Survivors')

Another way to create a new table consisting of a set of columns is to `drop` the columns you don't want.

In [27]:
minard.drop('Longitude', 'Latitude', 'Direction')

Neither `select` nor `drop` change the original table. Instead, they create new smaller tables that share the same data. The fact that the original table is preserved is useful! You can generate multiple different tables that only consider certain columns without worrying that one analysis will affect the other.

In [28]:
minard

All of the methods that we have used above can be applied to any table.

# 06.1. Sorting Rows

"The NBA is the highest paying professional sports league in the world," [reported CNN](http://edition.cnn.com/2015/12/04/sport/gallery/highest-paid-nba-players/) in March 2016. The table `nba_salaries` contains the salaries of all National Basketball Association players in 2015-2016.

Each row represents one player. The columns are:

| **Column Label**   | Description                                         |
|--------------------|-----------------------------------------------------|
| `PLAYER`           | Player's name                                       |
| `POSITION`         | Player's position on team                           |
| `TEAM`             | Team name                                           |
|`'15-'16 SALARY`    | Player's salary in 2015-2016, in millions of dollars|
 
The code for the positions is PG (Point Guard), SG (Shooting Guard), PF (Power Forward), SF (Small Forward), and C (Center). But what follows doesn't involve details about how basketball is played.

The first row shows that Paul Millsap, Power Forward for the Atlanta Hawks, had a salary of almost $\$18.7$ million in 2015-2016.

In [29]:
# This table can be found online: https://www.statcrunch.com/app/index.php?dataid=1843341
nba_salaries = Table.read_table(path_data + 'nba_salaries.csv')
nba_salaries

The table contains 417 rows, one for each player. Only 10 of the rows are displayed. The `show` method allows us to specify the number of rows, with the default (no specification) being all the rows of the table.

In [30]:
nba_salaries.show(3)

Glance through about 20 rows or so, and you will see that the rows are in alphabetical order by team name. It's also possible to list the same rows in alphabetical order by player name using the `sort` method. The argument to `sort` is a column label or index.

In [31]:
nba_salaries.sort('PLAYER').show(5)

To examine the players' salaries, it would be much more helpful if the data were ordered by salary.

To do this, we will first simplify the label of the column of salaries (just for convenience), and then sort by the new label `SALARY`. 

This arranges all the rows of the table in *increasing* order of salary, with the lowest salary appearing first. The output is a new table with the same columns as the original but with the rows rearranged.

In [32]:
nba = nba_salaries.relabeled("'15-'16 SALARY", 'SALARY')
nba.sort('SALARY')

These figures are somewhat difficult to compare as some of these players changed teams during the season and received salaries from more than one team; only the salary from the last team appears in the table. Point Guard Phil Pressey, for example, moved from Philadelphia to Phoenix during the year, and might be moving yet again to the Golden State Warriors. 

The CNN report is about the other end of the salary scale – the players who are among the highest paid in the world. 

To order the rows of the table in *decreasing* order of salary, we must use `sort` with the option `descending=True`.

In [33]:
nba.sort('SALARY', descending=True)

Kobe Bryant, in his final season with the Lakers, was the highest paid at a salary of $\$25$ million. Notice that the MVP Stephen Curry doesn't appear among the top 10. He is quite a bit further down the list, as we will see later.

## Named Arguments

The `descending=True` portion of this call expression is called a *named argument*. When a function or method is called, each argument has both a position and a name. Both are evident from the help text of a function or method.

In [34]:
help(nba.sort)

At the very top of this `help` text, the *signature* of the `sort` method appears:

    sort(column_or_label, descending=False, distinct=False)
    
This describes the positions, names, and default values of the three arguments to `sort`. When calling this method, you can use either positional arguments or named arguments, so the following three calls do exactly the same thing.

    sort('SALARY', True)
    sort('SALARY', descending=True)
    sort(column_or_label='SALARY', descending=True)
    
When an argument is simply `True` or `False`, it's a useful convention to include the argument name so that it's more obvious what the argument value means.

# 06.2. Selecting Rows

Often, we would like to extract just those rows that correspond to entries with a particular feature. For example, we might want only the rows corresponding to the Warriors, or to players who earned more than $\$10$ million. Or we might just want the top five earners.

## Specified Rows
The Table method `take` does just that – it takes a specified set of rows. Its argument is a row index or array of indices, and it creates a new table consisting of only those rows.

For example, if we wanted just the first row of `nba`, we could use `take` as follows.

In [35]:
help(nba.select)

In [36]:
nba

In [37]:
help(nba.column)

In [38]:
help(nba.take)

In [39]:
nba.take(0)

This is a new table with just the single row that we specified.

We could also get the fourth, fifth, and sixth rows by specifying a range of indices as the argument.

In [40]:
nba.take(np.arange(3, 6))

If we want a table of the top 5 highest paid players, we can first sort the list by salary and then `take` the first five rows:

In [41]:
nba.sort('SALARY', descending=True).take(np.arange(5))

## Rows Corresponding to a Specified Feature
More often, we will want to access data in a set of rows that have a certain feature, but whose indices we don't know ahead of time. For example, we might want data on all the players who made more than $\$10$ million, but we don't want to spend time counting rows in the sorted table.

The method `where` does the job for us. Its output is a table with the same columns as the original but only the rows *where* the feature occurs.

The first argument of `where` is the label of the column that contains the information about whether or not a row has the feature we want. If the feature is "made more than $\$10$ million", the column is `SALARY`.

The second argument of `where` is a way of specifying the feature. A couple of examples will make the general method of specification easier to understand.

In the first example, we extract the data for all those who earned more than $\$10$ million.

In [42]:
help(nba.where)

In [43]:
nba.where('SALARY', are.above(10))

The use of the argument `are.above(10)` ensured that each selected row had a value of `SALARY` that was greater than 10.

There are 69 rows in the new table, corresponding to the 69 players who made more than $10$ million dollars. Arranging these rows in order makes the data easier to analyze. DeMar DeRozan of the Toronto Raptors was the "poorest" of this group, at a salary of just over $10$ million dollars.

In [44]:
nba.where('SALARY', are.above(10)).sort('SALARY')

How much did Stephen Curry make? For the answer, we have to access the row where the value of `PLAYER` is equal to `Stephen Curry`. That is placed a table consisting of just one line:

In [45]:
nba.where('PLAYER', are.equal_to('Stephen Curry'))

Curry made just under $\$11.4$ million dollars. That's a lot of money, but it's less than half the salary of LeBron James. You'll find that salary in the "Top 5" table earlier in this section, or you could find it replacing `'Stephen Curry'` by `'LeBron James'` in the line of code above.

In the code, `are` is used again, but this time with the *predicate* `equal_to` instead of `above`. Thus for example you can get a table of all the Warriors:

In [46]:
nba.where('TEAM', are.equal_to('Golden State Warriors')).show()

This portion of the table is already sorted by salary, because the original table listed players sorted by salary within the same team. The `.show()` at the end of the line ensures that all rows are shown, not just the first 10.

It is so common to ask for the rows for which some column is equal to some value that the `are.equal_to` call is optional. Instead, the `where` method can be called with only a column name and a value to achieve the same effect.

In [47]:
nba.where('TEAM', 'Denver Nuggets') # equivalent to nba.where('TEAM', are.equal_to('Denver Nuggets'))

## Multiple Features
You can access rows that have multiple specified features, by using `where` repeatedly. For example, here is a way to extract all the Point Guards whose salaries were over $\$15$ million.

In [48]:
nba.where('POSITION', 'PG').where('SALARY', are.above(15))

## General Form
By now you will have realized that the general way to create a new table by selecting rows with a given feature is to use `where` and `are` with the appropriate condition:

`original_table_name.where(column_label_string, are.condition)`

In [49]:
nba.where('SALARY', are.between(10, 10.3))

Notice that the table above includes Danny Green who made $\$10$ million, but *not* Monta Ellis who made $\$10.3$ million. As elsewhere in Python, the range `between` includes the left end but not the right.

If we specify a condition that isn't satisfied by any row, we get a table with column labels but no rows.

In [50]:
nba.where('PLAYER', are.equal_to('Barack Obama'))

## Some More Conditions
Here are some predicates of `are` that you might find useful. Note that `x` and `y` are numbers, `STRING` is a string, and `Z` is either a number or a string; you have to specify these depending on the feature you want.

| **Predicate**              | Description                              |
|----------------------------|------------------------------------------|
| `are.equal_to(Z)`          | Equal to `Z`                             |        
| `are.above(x)`             | Greater than `x`                         |
| `are.above_or_equal_to(x)` | Greater than or equal to `x`             |
| `are.below(x)`             | Less than `x`                            |
| `are.below_or_equal_to(x)` | Less than or equal to `x`                |
| `are.between(x, y)`        | Greater than or equal to `x`, and less than `y` |
| `are.strictly_between(x, y)` | Greater than `x` and less than `y`     |
| `are.between_or_equal_to(x, y)` | Greater than or equal to `x`, and less than or equal to `y` |
| `are.containing(S)`        | Contains the string `S`                   |

You can also specify the negation of any of these conditions, by using `.not_` before the condition:

| **Predicate**              | Description                              |
|----------------------------|------------------------------------------|
| `are.not_equal_to(Z)`      | Not equal to `Z`                         |    
| `are.not_above(x)`         | Not above `x`                            |

... and so on. The usual rules of logic apply – for example, "not above x" is the same as "below or equal to x".

We end the section with a series of examples.

The use of `are.containing` can help save some typing. For example, you can just specify `Warriors` instead of `Golden State Warriors`:

In [51]:
nba.where('TEAM', are.containing('Warriors')).show()

You can extract data for all the guards, both Point Guards and Shooting Guards:

In [52]:
nba.where('POSITION', are.containing('G'))

You can get all the players who were not Cleveland Cavaliers and had a salary of no less than $\$20$ million:

In [53]:
other_than_Cavs = nba.where('TEAM', are.not_equal_to('Cleveland Cavaliers'))
other_than_Cavs.where('SALARY', are.not_below(20))

The same table can be created in many ways. Here is another, and no doubt you can think of more.

In [54]:
other_than_Cavs.where('SALARY', are.above_or_equal_to(20))

As you can see, the use of `where` with `are` gives you great flexibility in accessing rows with features that interest you. Don't hesitate to experiment!

# Summary:

    1. How to create table ? 
       
        my_table = Table().with_columns(
                'col1', make_array( 'row1', 'row2', 'row3' ),
                'col2', make_array( 1,      2,       3     )
            )
        
        my_table = Table.read_table ( 'full-path-to-your-data-file.csv' )

    2. How to manipulate the data in a table?  
       
    my_table.show 
    
    my_table.labels            List the labels of all the columns
    my_table.relabeled         Change column labels 
    
    my_table.num_columns       Give the number of columns in table
    my_table.num_rows          Give the number of rows in table
    
    my_table.column            Access the array of data in a column (based on label, index)
    my_table.take              Access the data in rows (based on indices)
    
    my_table.select            Choose sets of columns
    my_table.drop              Drop columns we do not want
    my_table.sort              Arrange rows of table based on sorting a specified column
    my_table.where             Select rows that satisfy a condition
    
    ...
  
## You may want to read help(), for instance:
    
    help( my_table.show )
    
    help( my_table.labels )
    help( my_table.relabeled )
    
    help( my_table.num_columns )
    help( my_table.num_rows )
    
    help( my_table.column )
    help( my_table.take )
    
    help( my_table.select )
    help( my_table.drop )
    help( my_table.sort ) 
    help( my_table.where ) 
    
    help( my_table.where )